[
  {
    "Id": "185",
    "ClientId": "64",
    "Title": "Jobs4Blue Rate Sheet - Bayonne PD (NJ)",
    "Body": "PAGEBREAK[] Important Hiring Information All job requests require a pre-construction meeting with Bayonne PD Traffic/Safety personnel prior to booking. You will receive a Bayonne Worksite Evaluation Form with a unique code. (Example: 2024-XXXXX). This number is REQUIRED for Jobs4Blue to approve of the off-duty work request. Please include this number in the DESCRIPTION of your job request to avoid a phone call from Jobs4Blue to obtain this information. PAGEBREAK[] Officer Wages: Officer WEEKDAY Rate: $70.00/hr Officer WEEKEND/HOLIDAY Rate: $85.00/hr SUPERVISOR WEEKDAY Rate: $75.00/hr SUPERVISOR WEEKEND/HOLIDAY Rate: $90.00/hr PAGEBREAK[] Fees: 1-2 Officer(s) Admin Fee: $20.00/hr per officer 3+ Officers Admin Fee: $10.00/hr per officer Supervisor Admin Fee: $6.25/hr per officer Vehicle Fee: $150.00 per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration, ONLY IF job is scheduled for 8+ hours in duration. If 3+ officers are being requested, an additional police Supervisor must be hired. If the job goes over 8 consecutive hours in duration on a WEEKDAY -> hourly rate increases to the WEEKEND / HOLIDAY hourly rate listed above for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. PAGEBREAK[] General Information If the contractor requests \"NO PARKING\" signs, the contractor must call the Traffic Division at (201)858-6963 to make the request and schedule the pickup."
  },
  {
    "Id": "186",
    "ClientId": "72",
    "Title": "Jobs4Blue Rate Sheet - Berkeley Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Security Rate: $60.00/hr Traffic Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "187",
    "ClientId": "2",
    "Title": "Jobs4Blue Rate Sheet - Bloomfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Control: $70.00/hr Security: Determined by Bloomfield PD at the time of request PAGEBREAK[] Fees: Admin Fee: $5.00/hr per officer Vehicle Fee: $15.00/hr per vehicle utilized. Vehicles are REQUIRED for all Road jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Any job requiring 4 or more officers = 1 officer must be a Supervisor, who will receive an additional $10.00 per hour PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information Contractors may request \"NO PARKING\" SIGNS, by calling Bloomfield PD directly. Please give the PD at least 48 hours notice prior to the job start."
  },
  {
    "Id": "188",
    "ClientId": "84",
    "Title": "Jobs4Blue Rate Sheet - Boonton PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Officers receive compensation based on rank: Officer Rate: $93.25/hr Sergeant Rate: $106.95/hr Lieutenant Rate: $116.45/hr Captain and Above: $129.40/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $100.00 per vehicle per day. Vehicles are required for all Road Jobs. J4B Service Fee: 8.5% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "189",
    "ClientId": "50",
    "Title": "Jobs4Blue Rate Sheet - Bordentown Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $105.00/hr PAGEBREAK[] Fees: Vehicle Fee: $50 per vehicle per day. Vehicles are required for all Road Construction jobs. J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: IIf the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information All requests for road construction must submit a Traffic Control Plan (TCP), prior to the start of the job, to one of the following Bordentown Township Administrative Officers: Chief Brian Pesce: bpesce@bordentowntownshippd.org Capt. Nathan Roohr: nroohr@bordentowntownshippd.org Lt. Frank Nucera: fnucera3@bordentowntownshippd.org Lt. Joshua Pavlov: jpavlov@bordentowntownshippd.org"
  },
  {
    "Id": "190",
    "ClientId": "52",
    "Title": "Jobs4Blue Rate Sheet - Branchburg PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: IIf the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. If the contractor cancels the detail OR the detail ends early, with officer on-site, the vendor will get billed for the entirety of the scheduled detail with all associated fees."
  },
  {
    "Id": "191",
    "ClientId": "76",
    "Title": "Jobs4Blue Rate Sheet - Burlington City PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr Emergency Rate (Jobs called in within 4 hours' notice): $120.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer Vehicle Fee: $15.00/hr per vehicle. Vehicles are required for all Traffic Jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "192",
    "ClientId": "83",
    "Title": "Jobs4Blue Rate Sheet - Burlington Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Private Traffic / Security Rate: $95.00/hr Non-Profit Organization Rate: $75.00/hr PAGEBREAK[] Fees: Admin Fee: $17.50/hr per officer Vehicle Fee: $12.50/hr per vehicle. Vehicles are required for all Road Construction. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 3.25 hours worked = 3.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay on all jobs scheduled for less than 4 hours in duration. All fees apply. If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay on all jobs scheduled for 4 or more hours in duration. All fees apply."
  },
  {
    "Id": "193",
    "ClientId": "3",
    "Title": "Jobs4Blue Rate Sheet - Carlstadt PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $66.64-$145.66 per hour per officer. PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer Vehicle Fee: $300.00 per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "194",
    "ClientId": "61",
    "Title": "Jobs4Blue Rate Sheet - Chatham Borough PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $107.64 Hourly Rate AFTER 8 consecutive hours of work: $117.64/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $75.00 per day per vehicle utilized J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: Non-Emergency jobs can ONLY be scheduled between 9:00AM-4:00PM unless approved by the Chatham Traffic Division. There is a 2-hour minimum per each officer hired, for jobs scheduled less than 4 hours. Any job booked for 4 or more hours will remain at a 4 hour minimum. All jobs are rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information All NEW vendors must submit Proof of Liability Insurance and a Hold Harmless Agreement before jobs may be scheduled. These forms must be sent to Kellie McGuire, at kmcguire@chathampd.org. PAGEBREAK[]"
  },
  {
    "Id": "195",
    "ClientId": "63",
    "Title": "Jobs4Blue Rate Sheet - Chatham Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $75.00 per day per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicle Fee is required for ALL Traffic Jobs. Vehicle Fee is optional for Security jobs only. All jobs round up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "196",
    "ClientId": "59",
    "Title": "Jobs4Blue Rate Sheet - Chicopee PD (MA)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $60.00/hr Standard Hourly Rate AFTER 8 consecutive hours of work: $90.00/hr HOLIDAY Rate: $120.00/hr HOLIDAY Rate AFTER 8 consecutive hours of work: $180.00/hr PAGEBREAK[] Fees: Admin Fee: 10% of the total cost FICA Medicate Tax: 1.45% of hourly wages Vehicle Fee: $20.00 per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs 8+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. All jobs are rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "197",
    "ClientId": "73",
    "Title": "Jobs4Blue Rate Sheet - Clayton PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: ROAD JOB Hourly Rate: $80.00/hr COUNTY JOB Hourly Rate: $67.00/hr Board of Education Hourly Rate: $65.00/hr PAGEBREAK[] Fees: Admin Fee: 15% of the total cost Vehicle Fee: $150.00 per day per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "198",
    "ClientId": "5",
    "Title": "Jobs4Blue Rate Sheet - Cranford PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00/hr per officer Vehicle Fee: 25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "199",
    "ClientId": "6",
    "Title": "Jobs4Blue Rate Sheet - Deal PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Hourly Rate: $95.00/hr House of Worship: $50.00/hr Private Event (weddings, parties, etc.): $95.00/hr PAGEBREAK[] Fees: Officer Admin Fee: $10.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Deal Police Department DOES NOT work inside Party Security. They can ONLY work outside Traffic Control for parties. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay including all fees. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Deal PD for approval before the request is posted. If your request is CANCELLED by Deal Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "200",
    "ClientId": "38",
    "Title": "Jobs4Blue Rate Sheet - Delanco PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Day (6AM-6PM) Rate: $125.00/hr After-Hours (6PM-6AM) / Weekend Job Rate: $150.00/hr Holiday Rate: $175.00/hr PAGEBREAK[] Fees: Officer Admin Fee: $100.00 per job day Vehicle Fee: $175.00 per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail WITHIN 3-8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay, including the admin/J4B fee. If the contractor cancels ANY work detail LESS than 3-hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay, including the admin/J4B fee. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: All vendors must send an insurance certificate to Lt. Adam Tilger before booking a job. Ordinance requires vendor to supply insurance certificate which includes indication that the township is named as the additional insurer. Please send these required forms to atilger@delancotownship.com."
  },
  {
    "Id": "201",
    "ClientId": "37",
    "Title": "Jobs4Blue Rate Sheet - Delaware State Police (DE)",
    "Body": "PAGEBREAK[] Trooper Wages: Hourly Rate: $78.00/hr PAGEBREAK[] Fees: Vehicle Fee: $18.00 per hour, per vehicle Mounted Patrol Unit (Horse Unit): $19.75 per hour, per horse (if requested) J4B Service Fee: 4% of the total cost PAGEBREAK[] Hiring Rules: There is a 1.5-hour minimum per each officer hired. All jobs are rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). Any jobs 5+ hours in duration will be split into two equal shifts. Any jobs for 10+ hours will be split once into two 5-hour shifts, and then split again into four 2.5-hour shifts. Each job that is split is treated as its own job. If relieving shifts fall under the defined Cancellation Policy, the troopers will be compensated for the minimum payout UNLESS the trooper is assigned to back-to-back shifts. All Delaware traffic jobs REQUIRE a vehicle. Delaware Troopers CANNOT work plain-clothes details. They must be dressed in full uniform. Escorts: Vendor must compensate Trooper for Travel Time to and from the escort locations. Troopers CANNOT travel into other states. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 1.5-hour minimum pay, including all fees."
  },
  {
    "Id": "202",
    "ClientId": "90",
    "Title": "Jobs4Blue Rate Sheet - East Hanover PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.52/hr PAGEBREAK[] Fees: Admin Fee: 8.50% of job cost J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs that are worked past 4 hours will be billed at a 8-hour minimum. All jobs over 8 hours worked round up to the nearest half hour. (i.e. 8.25 hours worked = 8.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. All fees apply. If the contractor cancels ANY work detail after the start time of the detail, the contractor is responsible for compensating the officer to a 4-hour minimum. All fees apply."
  },
  {
    "Id": "203",
    "ClientId": "98",
    "Title": "Jobs4Blue Rate Sheet - Elmwood Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Traffic Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $55.00/hr per officer (includes vehicle cost) J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "205",
    "ClientId": "65",
    "Title": "Jobs4Blue Rate Sheet - Fairfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate for DAYTIME working hours between 6AM-6PM: $90.00/hr Hourly Rate for EVENING working hours between 6PM-6AM / Weekends / holidays: $135.00/hr Premium Overtime Rate (over 8 consecutive hours of work during Day Hours): $135.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $200.00 (for jobs up to 4-hours) Vehicle Fee: $350.00 (for jobs over 4-hours) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicle Fee is only applicable for traffic jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "206",
    "ClientId": "40",
    "Title": "Jobs4Blue Rate Sheet - Fort Lee PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00/hr per officer Vehicle Fee: $75.00 per day per vehicle utilized. Vehicles are REQUIRED for all Road jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: Non-Emergency jobs CANNOT be scheduled before 7:30AM unless approved by the Fort Lee Traffic Division. There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: All road work being performed on Main Street must first be confirmed with Lt. Mark Radoian of the Fort Lee Traffic Division. Please contact Mark via email at mradoian@fortleepolice.org prior to booking your request."
  },
  {
    "Id": "207",
    "ClientId": "46",
    "Title": "Jobs4Blue Rate Sheet - Franklin Township PD (Somerset County, NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Security Rate: $65.82/hr Traffic Control Rate: $87.34/hr Emergency Rate (same-day request): $102.00/hr Weekend Rate: $102.00/hr Any jobs worked between the hours of 7PM-7AM: $102.00/hr PAGEBREAK[] Fees: Security Admin Fee: $7.31/hr per officer Traffic Control Admin Fee: $9.71/hr per officer J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: For TRAFFIC CONTROL jobs only: There is a 4-hour minimum per each officer hired. All jobs 10+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. PAGEBREAK[] Cancellation Policy: Traffic Control: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. Security: If the contractor cancels ANY work detail within 8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "208",
    "ClientId": "103",
    "Title": "Jobs4Blue Rate Sheet - Freehold Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $95.00/hr Holiday Rate: $110.00/hr TRUE EMERGENCY WORK (pole down, water main, gas leak, etc.): $95.00/hr OR 1.5x Officer Hourly Rate (whichever is greater) PAGEBREAK[] Fees: Standard Admin Fee: $21.50/hr per officer Holiday / Over 8 Consecutive Hours Admin Fee: $23.00/hr per officer Half-Day (less than 4 hours) Vehicle Fee: $78.00 per day per vehicle utilized Full-Day (more than 4 hours) Vehicle Fee: $158.00 per day per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. If the job ends earlier than scheduled -> 4 hours are added to the officer's end time, NOT TO EXCEED the times that the job was scheduled for. If the job goes over 8 consecutive hours in duration -> hourly rate increases to the $110.00/hr for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Freehold Admin Fee and Vehicle fee will not be charged if cancellation is made before the start time of the detail. J4B Service Fee still applies. PAGEBREAK[] General Information If the work request is for a TRUE EMERGENCY (pole down, water main, gas leak, etc.) -> contact the Freehold Township Police Department directly at (732) 462-7908. Freehold Township will then provide Jobs4Blue with instruction on how to proceed. For after-hours emergencies, contact Freehold Township County Dispatch at (732) 462-7500."
  },
  {
    "Id": "209",
    "ClientId": "78",
    "Title": "Jobs4Blue Rate Sheet - Garfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer Vehicle Fee: $25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[]"
  },
  {
    "Id": "210",
    "ClientId": "62",
    "Title": "Jobs4Blue Rate Sheet - Garwood PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr Emergency Rate (Jobs called in with less than 3 hours' notice): $100.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $200.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1.5 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "211",
    "ClientId": "80",
    "Title": "Jobs4Blue Rate Sheet - Gloucester Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00/hr per officer Vehicle Fee: $20.00/hr per vehicle utilized. Vehicles are REQUIRED for all Road jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2-hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum compensation. All fees apply."
  },
  {
    "Id": "212",
    "ClientId": "7",
    "Title": "Jobs4Blue Rate Sheet - Hazlet PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.22/hr PAGEBREAK[] Fees: Admin Fee: $30.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: Any NEW contractors, who have never worked with Hazlet PD prior, must register with Hazlet PD BEFORE any jobs are scheduled. New contractors can register with Hazlet PD by emailing Rhonda Shultz at rschultz@hazletpd.org and will be given information on how to proceed."
  },
  {
    "Id": "213",
    "ClientId": "8",
    "Title": "Jobs4Blue Rate Sheet - Hillside PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $75.00/hr Traffic Rate (Weekend/Holidays): $110.00/hr Security Rate: $50.00/hr PAGEBREAK[] Fees: Admin Fee: 19% of total officer wages Vehicle Fee: $15.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] $40.00 (per job) Booking Fee for jobs scheduled within 48 hours prior to the start time. $75.00 (per job) Booking Fee for jobs scheduled within 4 hours prior to the start time. PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired for Traffic details. There is a 2-hour minimum per each officer hired for Security details. All jobs round up to the full work hour (ie. 4.5 hours will be billed at 5 hours) PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Hillside PD for approval before the request is posted. If your request is CANCELLED by Hillside Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason. There is a maximum of TWO (2) officers hired for any individual work site. Any requests for more than 2 officers will be adjusted to the 2 officer maximum."
  },
  {
    "Id": "214",
    "ClientId": "21",
    "Title": "Jobs4Blue Rate Sheet - Hopewell Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly For-Profit Rate: $100.00/hr Hourly Non-Profit Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00 per hour, per officer Vehicle Fee: $10.00 per hour, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. If the job goes over 8 consecutive hours in duration -> hourly rate increases to the $120.00 for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork, where the job times are outside Hopewell's standard operating hours (9AM-3:30PM), will automatically be sent to Hopewell Township PD for approval before the request is posted. If your request is CANCELLED by Hopewell Township Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "215",
    "ClientId": "66",
    "Title": "Jobs4Blue Rate Sheet - Howell PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr Hourly Emergency Rate (jobs called in with less than 12 hours notice): $125.00/hr Hourly Holiday Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr EMERGENCY Admin fee (less than 12 hours notice): $30.00/hr Vehicle Fee: $10.00/hr J4B Service Fee: 8.5% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "216",
    "ClientId": "71",
    "Title": "Jobs4Blue Rate Sheet - Jackson PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $72.50/hr PAGEBREAK[] Fees: Admin Fee: $17.50/hr Vehicle Fee: $10.00/hr, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicles are REQUIRED for all hiring requests. (Ordinance 23-24): Once an extra duty job has been assigned to an officer, any time changes made within 24 hours of the original start time, shall result in an additional 4 hour minimum being charged to the contractor for each assigned officer. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Jackson PD for approval before the request is posted. If your request is CANCELLED by Jackson Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "218",
    "ClientId": "9",
    "Title": "Jobs4Blue Rate Sheet - Lawrence Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: For-Profit Hourly Rate: $85.00/hr For-Profit EMERGENCY Rate (jobs called in with less than 24 hours' notice): $100.00/hr For-Profit Holiday & Sunday Rate: $100.00/hr Non-Profit Rate: $50.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00/hr, per officer Vehicle Fee: $28.00/hr, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Lawrence Township Admin Fee and Vehicle fee will not be charged if cancellation is made before the start time of the detail. J4B Service Fee still applies. PAGEBREAK[]"
  },
  {
    "Id": "219",
    "ClientId": "91",
    "Title": "Jobs4Blue Rate Sheet - Lincoln Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "220",
    "ClientId": "10",
    "Title": "Jobs4Blue Rate Sheet - Linden PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Daytime Rate (Jobs worked between 6AM-6PM): $96.00/hr Hourly Evening Rate (Jobs worked between 6PM-6AM): $143.00/hr Hourly Weekend & Holiday Rate: $143.00/hr Hourly EMERGENCY Rate (Jobs scheduled with less than 12 hours' notice): $143.00/hr PAGEBREAK[] Fees: Admin Fee: $50.00 flat fee per officer, per job day PBA Fee: $1.00/hr LPSOA Union Fee: $1.00/hr Vehicle Fee: $150.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. All jobs are rounded up to the nearest 1/2 hour (ie. 4.25 hours worked will be billed at 4.5 hours) If the job goes over 8 consecutive hours in duration -> hourly rate increases to $143.00/hr for each additional 30 minute increment. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "221",
    "ClientId": "17",
    "Title": "Jobs4Blue Rate Sheet - Logan Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $95.00/hr BOE / House of Worship Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: 20% of the officer wage / vehicle fee cost Vehicle Fee: $40.00 per vehicle for HALF DAY (4 hours or less worked) Vehicle Fee: $80.00 per vehicle for FULL DAY (4.5 hours or more worked) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. If the contractor cancels ANY work detail AFTER the start time of the job, the contractor is responsible for compensating the officer to a 4-hour minimum. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "222",
    "ClientId": "11",
    "Title": "Jobs4Blue Rate Sheet - Mantoloking PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: 10% of the officer hourly wages J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "223",
    "ClientId": "104",
    "Title": "Jobs4Blue Rate Sheet - Mantua Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $85.00/hr County Job Rate: $81.63/hr House of Worship Security: $65.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr Vehicle Fee: $18.00/hr, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs 5+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. Officer compensation is rounded up to the nearest 1/2 hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "224",
    "ClientId": "93",
    "Title": "Jobs4Blue Rate Sheet - Mercer County Sheriff (NJ)",
    "Body": "PAGEBREAK[] Please note that the local police jurisdiction should be contacted first BEFORE outsourcing to the Mercer County Sheriff's Office. PAGEBREAK[] Officer Wages: Hourly Rate is correspondent with the same wage amounts per the town they are working for. PAGEBREAK[] Fees: Admin Fee is correspondent with the admin fee of the hiring town. Vehicle Fee is correspondent with the vehicle fee of the hiring town. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: Cancellation policy is correspondent with the cancellation policy of the hiring town and subject to all wages and fees. PAGEBREAK[]"
  },
  {
    "Id": "225",
    "ClientId": "12",
    "Title": "Jobs4Blue Rate Sheet - Middlesex Borough PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Vehicle Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Marked Police Vehicles are REQUIRED for all hiring requests. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Middlesex PD for approval before the request is posted. If your request is CANCELLED by Middlesex Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "226",
    "ClientId": "108",
    "Title": "Jobs4Blue Rate Sheet - Glassboro PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: 15% of the total wage cost J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. All jobs 6+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer(s) to the 2-hour minimum pay. All fees apply. If the contractor cancels any work detail AFTER the start time of the job, the contractor is responsible for compensating the officer(s) for the entire scheduled duration of the detail. All fees apply."
  },
  {
    "Id": "227",
    "ClientId": "107",
    "Title": "Jobs4Blue Rate Sheet - Glen Ridge PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $86.49/hr If the job goes over 8 consecutive hours in duration, the hourly rate increases to the $129.74 for each additional work hour. PAGEBREAK[] Fees: Admin Fee: 10% of the wage cost Vehicle Fee: $25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. There is a 5-hour minimum per each officer hired for EMERGENCY (same day jobs). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "228",
    "ClientId": "111",
    "Title": "Jobs4Blue Rate Sheet - Island Heights PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr Vehicle Fee: $25.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "229",
    "ClientId": "112",
    "Title": "Jobs4Blue Rate Sheet - Lakewood PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly For-Profit Rate: $80.00/hr Hourly For-Profit EMERGENCY Rate (jobs scheduled with less than 48 hours' notice): $95.00/hr Hourly Non-Profit Rate: $40.00/hr PAGEBREAK[] Fees: For-Profit Job Admin Fee: $20.00/hr per officer Non-Profit Job Admin Fee: $7.00/hr per officer PBA Fee: $1.00/hr per officer Vehicle Fee: $100.00 per day, per vehicle utilized. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicles are REQUIRED for all jobs with the exception of Non-Profits. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[]"
  },
  {
    "Id": "230",
    "ClientId": "101",
    "Title": "Jobs4Blue Rate Sheet - Millburn PD (NJ)",
    "Body": "PAGEBREAK[] OFFICER WAGES: Standard Hourly Traffic Rate: $80.00/hr EVENING Traffic Rate (jobs worked between 6PM-7AM): $94.00/hr Sunday and Holiday Traffic Rate: $94.00/hr EVENING Sunday and Holiday Traffic Rate (jobs worked between 6PM-7AM): $108.00/hr PAGEBREAK[] Standard Hourly Security Rate: $64.00/hr Sunday and Holiday Security Rate: $70.00/hr PAGEBREAK[] Fees: Admin Fee: $8.00/hr per officer Vehicle Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All TRAFFIC jobs require a vehicle. PAGEBREAK[] Any job that goes beyond the scheduled posted time will receive a $14.00/hr additional officer compensation. Any job scheduled with less than 12 hours' notice will receive an additional $14.00/hr officer compensation. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Millburn PD for approval before the request is posted. If your request is CANCELLED by Millburn Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "231",
    "ClientId": "85",
    "Title": "Jobs4Blue Rate Sheet - Montville PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Traffic Rate: $80.00/hr Holiday and Weekend Traffic Rate: $120.00/hr If the job goes over 8 consecutive hours in duration on a WEEKDAY -> hourly rate increases to the $120.00/hr for each additional work hour. If the job goes over 8 consecutive hours in duration on a HOLIDAY -> hourly rate increases to the $200.00/hr for each additional work hour. Hazard Duty Rate: (Any hours worked between 6PM-7AM) add an additional $5.00/hr onto rates listed above. PAGEBREAK[] Standard Hourly Security Rate: $55.00/hr Holiday and Weekend Security Rate: $82.50/hr If the job goes over 8 consecutive hours in duration on a WEEKDAY -> hourly rate increases to the $82.50/hr for each additional work hour. If the job goes over 8 consecutive hours in duration on a HOLIDAY -> hourly rate increases to the $137.50/hr for each additional work hour. PAGEBREAK[] Fees: Admin Fee: 10% of officer wages Vehicle Fee: $10.00/hr per vehicle J4B Service Fee: 8.5% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). All TRAFFIC jobs require a vehicle. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "232",
    "ClientId": "97",
    "Title": "Jobs4Blue Rate Sheet - Morris Plains PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $88.00/hr Holiday Rate: $98.00/hr PAGEBREAK[] Fees: Admin Fee: $8.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8.5% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Any job that goes beyond the scheduled posted time will be compensated at $98.00/hr for each additional hour worked. Any job that goes beyond the scheduled posted time ON A HOLIDAY will be compensated at $105.00/hr for each additional hour worked. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "233",
    "ClientId": "51",
    "Title": "Jobs4Blue Rate Sheet - Neptune City PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $125.00 per officer, per job J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "234",
    "ClientId": "13",
    "Title": "Jobs4Blue Rate Sheet - Neptune Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: Any NEW contractors, who have never worked with Neptune Twp PD prior, must register with Neptune Twp PD BEFORE any jobs are scheduled. New contractors can register with Neptune Twp PD by emailing Patti DeRosa at pderosa@neptunepolice.org and will be given information on how to proceed. Pre-existing vendors hiring for SECURITY need the departmentâ€™s approval for the number of officers hired per job request. Please fill out the Security Request form, found at the link below, and send to Patti DeRosa at pderosa@neptunepolice.org BEFORE submitting your request. Security Request Form: https://neptunepolice.org/wp-content/uploads/2019/05/Agreement-for-Security-Duty-Assignment-of-Officers.pdf"
  },
  {
    "Id": "235",
    "ClientId": "45",
    "Title": "Jobs4Blue Rate Sheet - Newtown PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Standard WEEKDAY-DAYTIME (hours worked between 7AM-12AM) Rate: $72.08/hr Standard WEEKDAY-OVERNIGHT (hours worked between 12AM-7AM) Rate : $94.44/hr Weekend and Holiday Rate: $94.44/hr PAGEBREAK[] Fees: Admin Fee: $17.00/hr per officer Vehicle Fee: $25.00/hr per vehicle utilized. Vehicles are REQUIRED for all jobs. J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: If the contractor wants to request a lesser number of vehicles than officers hired, they must contact the shift commander at 203-426-5841 to get approval."
  },
  {
    "Id": "236",
    "ClientId": "89",
    "Title": "Jobs4Blue Rate Sheet - Northvale PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $43.27-$116.15 per hour per officer. PAGEBREAK[] Fees: Admin Fee: 10% of the hourly wage and vehicle cost Vehicle Fee: $75.00 per vehicle utilized. Vehicles are REQUIRED for all jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "237",
    "ClientId": "-1",
    "Title": "Jobs4Blue Rate Sheet - Palisades Interstate Parkway PD (NJ)",
    "Body": "x"
  },
  {
    "Id": "238",
    "ClientId": "14",
    "Title": "Jobs4Blue Rate Sheet - Passaic PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized. Vehicles are REQUIRED for all Road Jobs. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Passaic PD for approval before the request is posted. If your request is CANCELLED by Passaic Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason. If a NO PARKING SIGN is needed: Contractor must call Passaic Traffic Safety: 973-364-3920 to make the request (leave voicemail if there is no answer). Signs must be posted 24 hours before job start time to be enforced by Passaic Police Dept. Unless emergent, there should be NO ROAD JOB REQUESTS ON ANY SUNDAY, by Passaic City ordinance."
  },
  {
    "Id": "239",
    "ClientId": "99",
    "Title": "Jobs4Blue Rate Sheet - Pennington PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "240",
    "ClientId": "34",
    "Title": "Jobs4Blue Rate Sheet - Perth Amboy PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $80.00/hr Security Rate: $70.00/hr Non-Profit Rate: $50.00/hr PAGEBREAK[] Fees: Admin Fee: $7.00/hr per officer Vehicle Fee: $100.00 flat (for the first 4-hours minimum) -> +$12.00/hr for each additional hour per vehicle utilized. J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. If 5+ officers are being requested, an additional police Supervisor must be hired at the Supervisor Rate of 10.5% increase per job rate. All Traffic Jobs REQUIRE a police vehicle. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[]"
  },
  {
    "Id": "241",
    "ClientId": "124",
    "Title": "Jobs4Blue Rate Sheet - Lacey Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Pay Rate is determined by officer hired, and can be anywhere between $43.51-$148.83 per hour per officer. PAGEBREAK[] Fees: Admin Fee: 25% of officer wage cost J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "242",
    "ClientId": "113",
    "Title": "Jobs4Blue Rate Sheet - Egg Harbor Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs are rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Egg Harbor Twp PD for approval before the request is posted. If your request is CANCELLED by Egg Harbor Twp Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "243",
    "ClientId": "109",
    "Title": "Jobs4Blue Rate Sheet - Plainville PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Weekday/Daytime Rate (jobs worked between 6AM-12:00AM (Midnight)): $79.31/hr Weekday/Overnight Rate (jobs worked between 12:00AM (Midnight)-6AM): $105.74/hr Weekend/Holiday Rate $105.74/hr PAGEBREAK[] Fees: Admin Fee: 15% of the officer hourly wages Vehicle Fee: $24.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> hourly rate increases to $105.74/hr for each additional work hour. Any jobs that are scheduled to span 4:00PM OR 12:00AM will be SPLIT at that respective time of day and will have an additional job with a 4-hour minimum created that begins at that respective time. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "244",
    "ClientId": "48",
    "Title": "Jobs4Blue Rate Sheet - Pompton Lakes PD (NJ)",
    "Body": "PAGEBREAK[] IMPORTANT NOTE: To avoid a phone call from a Jobs4Blue agent, please make sure that all of the following are answered, in your job posting, in the COMMENTS section: What type of work is being done? Will you be working in an intersection? Is there a need to shut down the road or alternate traffic? (If yes, always require minimum of 2 officers) Will the work be completed in one day or require multiple days (multiple days usually require a pre-construction meeting with Pompton Lakes PD)? Will you be hiring an additional officer from an outside agency? PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Pompton Lakes PD for approval before the request is posted. If your request is CANCELLED by Pompton Lakes Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "245",
    "ClientId": "94",
    "Title": "Jobs4Blue Rate Sheet - Princeton PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $119.00/hr PAGEBREAK[] Fees: J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail between 3-6 hours of the assignment start time, the contractor is responsible for compensating the officer to a 2-hour minimum pay. All fees apply. If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Princeton PD for approval before the request is posted. If your request is CANCELLED by Princeton Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "246",
    "ClientId": "-1",
    "Title": "Jobs4Blue Rate Sheet - Rahway PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Non-Emergency Traffic Rate: $75.00/hr Hourly Emergency Traffic Rate (jobs called in same day OR after 4PM for the following day): $90.00/hr Hourly Security Rate: $55.00/hr Holiday Rate: 1.5x of the rate for the job classification listed above PAGEBREAK[] Fees: Admin Fee: $12.00/hr per officer Vehicle Fee: $15.00/hr per vehicle utilized. Vehicles are REQUIRED for all Road Jobs. J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). If the job goes over 8 consecutive hours in duration -> hourly rate increases to 1.5X the listed rate for each additional work hour. If the job goes over 8 consecutive hours in duration ON A HOLIDAY -> hourly rate increases to 2.0X the listed rate for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "247",
    "ClientId": "36",
    "Title": "Jobs4Blue Rate Sheet - Raritan Township PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr School Rate: $75.00/hr PAGEBREAK[] Fees: Admin Fee: $22.33/hr per officer School Admin Fee (for BOE only): $18.61/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "248",
    "ClientId": "58",
    "Title": "Jobs4Blue Rate Sheet - Riverside PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Pay Rate is determined by officer OVERTIME (1.5x hourly) rate, and can be anywhere between $48.33-$130.30 per hour per officer. PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee: $50.00 per 4-hour block (0-4 hour block: $50.00 per vehicle; 5-8 hour block: $100.00 per vehicle; 9-12 hour block: $150.00 per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs 8+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "249",
    "ClientId": "96",
    "Title": "Jobs4Blue Rate Sheet - Rochelle Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $100.00-$154.56 per hour per officer. PAGEBREAK[] Fees: Vehicle Fee: $20.00/hr per vehicle utilized Admin Fee: 20% of the total cost J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. Officer compensation is rounded up by 2-hour blocks, only IF the job goes over the originally scheduled time. (i.e. A job scheduled for 4-hours, lasting 5 hours in duration will be billed at 6 hours.) PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail between 24 and 8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. All fees apply. If the contractor cancels ANY work detail within 8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "250",
    "ClientId": "77",
    "Title": "Jobs4Blue Rate Sheet - Roselle Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Day Rate (hours worked between 7AM-6PM): $80.00/hr Evening Rate (hours worked between 6PM-7AM): $120.00/hr Emergency (less than 8 hours notice; same day job), Weekend and Holiday Rate: $120.00/hr PAGEBREAK[] Fees: Vehicle Fee: $200.00 per day, per vehicle utilized. Vehicles are REQUIRED for all Road Jobs. Admin Fee: 10% of the officer wages and vehicle charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> hourly rate increases to $120.00/hr for each additional work hour. Officer compensation after the 8-hour minimum is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "251",
    "ClientId": "35",
    "Title": "Jobs4Blue Rate Sheet - Roselle PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Day Hourly Rate (hours worked between 7AM-6PM): $79.00/hr Evening Hourly Rate (hours worked after 6PM to job completion): $119.00/hr Emergency (less than 12 hours notice; same day job), Weekend and Holiday Rate: $119.00/hr PAGEBREAK[] Fees: PBA Fee: $1.00/hr per officer Vehicle Fee: $150.00 per day, per vehicle utilized Admin Fee: 18% of the officer wages, PBA, and vehicle charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> hourly rate increases to $119.00/hr for each additional work hour. Officer compensation after the 8-hour minimum is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "252",
    "ClientId": "42",
    "Title": "Jobs4Blue Rate Sheet - Scotch Plains PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Traffic Rate: $70.00/hr Emergency Traffic Rate: $90.00/hr Security Rate: $60.00/hr PAGEBREAK[] Fees: Vehicle Fee: $125.00 per day, per vehicle utilized. Traffic Admin Fee: 12.5% of the officer wages and vehicle charge Security Admin Fee: 4.5% of the officer wages and vehicle charge J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. TRAFFIC JOBS ONLY: Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). Officer compensation after the 8-hour minimum is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). STANDARD TRAFFIC JOBS ONLY: If the job goes over 8 consecutive hours in duration -> hourly rate increases to $105.00/hr for each additional work hour. SECURITY JOBS ONLY: If the job goes over 8 consecutive hours in duration -> hourly rate increases to $90.00/hr for each additional work hour. PAGEBREAK[] Cancellation Policy: TRAFFIC JOBS: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. SECURITY JOBS: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. All other fees apply."
  },
  {
    "Id": "253",
    "ClientId": "100",
    "Title": "Jobs4Blue Rate Sheet - Seaside Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $90.09/hr Security Rate: $40.00/hr PAGEBREAK[] Fees: Vehicle Fee: $10.00/hr per vehicle utilized Admin Fee: $12.01/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2 hour minimum per each officer hired. All jobs 5+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. Vehicles are REQUIRED for all road jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. All fees apply."
  },
  {
    "Id": "254",
    "ClientId": "74",
    "Title": "Jobs4Blue Rate Sheet - Somerville PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $120.00/hr PAGEBREAK[] Fees: J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. All jobs are rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "255",
    "ClientId": "110",
    "Title": "Jobs4Blue Rate Sheet - South Bound Brook PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.51/hr PAGEBREAK[] Fees: Vehicle Fee: $12.50/hr per vehicle utilized Admin Fee: $10.00 per officer per work hour J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. All jobs are rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). All jobs 8+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. If the contractor cancels the detail OR the detail ends early, with officer on-site, the vendor will get billed for the entirety of the scheduled detail with all associated fees."
  },
  {
    "Id": "256",
    "ClientId": "18",
    "Title": "Jobs4Blue Rate Sheet - Toms River PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Traffic Rate: $85.00/hr Emergency Traffic Rate (within 4 hours notice): $95.00/hr Security Rate: $63.00/hr PAGEBREAK[] Fees: TRAFFIC: Standard Traffic Admin Fee: $13.00/hr per officer Emergency Traffic Admin Fee: $15.00/hr per officer J4B Traffic Service Fee: 8% of the total cost PAGEBREAK[] SECURITY: Security Admin Fee: $13.00/hr per officer J4B Security Service Fee: 5% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "257",
    "ClientId": "68",
    "Title": "Jobs4Blue Rate Sheet - Union County PD (NJ)",
    "Body": "PAGEBREAK[] For MUTUAL AID COVERAGE: Please note that the local police jurisdiction should be contacted first BEFORE outsourcing to Union County PD. For PARK JOBS: Please continue with booking as the Union County PD covers all Union County Parks. PAGEBREAK[] MUTUAL AID COVERAGE: PAGEBREAK[] Wages: Outside Job Rate: Hourly Rate is correspondent with the same wage amounts per the town they are working for. PAGEBREAK[] Fees: Admin Fee: 10% of the total wages Vehicle Fee is correspondent with the vehicle fee of the hiring town. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: Minimum hours required are correspondent with the minimum hours required of the hiring town. PAGEBREAK[] Cancellation Policy: Cancellation policy is correspondent with the cancellation policy of the hiring town and subject to all wages and fees. PAGEBREAK[] Union County PARK JOBS: PAGEBREAK[] Wages: Park Job Rate: $65.00/hr per officer Park Job Supervisor Rate: $75.00/hr per supervisor PAGEBREAK[] Fees: Admin Fee: 10% of the total wage and vehicle cost J4B Service Fee: 7% of the total cost Park Job Vehicle Fee: $50.00 per day PAGEBREAK[] Hiring Rules: All Park Jobs requesting 4 or more officers will REQUIRE a Supervisor. Park Job cancellations within 2-hours of the job start time will result in a 2-hour minimum compensation to the officer(s). Admin and Jobs4Blue fees apply. PAGEBREAK[]"
  },
  {
    "Id": "258",
    "ClientId": "69",
    "Title": "Jobs4Blue Rate Sheet - Union County Sheriff (NJ)",
    "Body": "PAGEBREAK[] Please note that the local police jurisdiction should be contacted first BEFORE outsourcing to the Union County Sheriff's Office. PAGEBREAK[] Officer Wages: Outside Job Rate: Hourly Rate is correspondent with the same wage amounts per the town they are working for. PAGEBREAK[] Fees: Admin Fee: 10% of the total wages Vehicle Fee is correspondent with the vehicle fee of the hiring town. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: Minimum hours required are correspondent with the minimum hours required of the hiring town. PAGEBREAK[] Cancellation Policy: Cancellation policy is correspondent with the cancellation policy of the hiring town and subject to all wages and fees. PAGEBREAK[]"
  },
  {
    "Id": "259",
    "ClientId": "44",
    "Title": "Jobs4Blue Rate Sheet - Ventnor City PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $78.04/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Ventnor City PD for approval before the request is posted. If your request is CANCELLED by Ventnor City Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "260",
    "ClientId": "15",
    "Title": "Jobs4Blue Rate Sheet - Verona PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr Emergency Hourly Rate: $95.00/hr or 1.5x Officer's Hourly Rate - whichever is greater. PAGEBREAK[] Fees: Vehicle Fee: $50.00+ (increases by $50.00 for each 4-hour block of time vehicle is utilized) Admin Fee: $6.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicles are REQUIRED for all jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. The Verona Admin and Vehicle fee will not be charged if cancellation is made before the start time of the detail. The J4B Service Fee still applies."
  },
  {
    "Id": "261",
    "ClientId": "60",
    "Title": "Jobs4Blue Rate Sheet - West New York PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Daytime Rate (hours worked between 7AM-4PM): $95.00/hr After-Hours Rate (hours worked between 4PM-7AM): $105.00/hr Emergency / Same Day Rate: $105.00/hr Weekend / Holiday Rate: $105.00/hr PAGEBREAK[] Fees: Vehicle Fee: $100.00 per day, per vehicle utilized Admin Fee: $15.00/hr per officer (Admin Fee $10, PBA Fee $3, PSA Fee $2) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). Vehicle Fee is REQUIRED for all road jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: If vendor needs to request no parking area for construction work, West New York needs to notify their residents 48 hours in advance to post a no parking area. If an area needs to be posted as \"No Parking\", please email Lt. Andres Rana, at Andres.rana@wnypdnj.org, and cc P.O. Villegas, at Jose.villegas@wnypdnj.org. In addition please call the traffic office at 201-295-5025. If there is a request to cover the parking meters â€“ call the Parking Authority at 201-295-1575."
  },
  {
    "Id": "262",
    "ClientId": "47",
    "Title": "Jobs4Blue Rate Sheet - West Windsor PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $80.00/hr Security Rate: $65.00/hr Late Request Rate (called in within 48 hours): $85.00/hr Holiday Rate: $105.00/hr PAGEBREAK[] Fees: Vehicle Fee: $12.50/hr per vehicle utilized Admin Fee: 15% of the officer wages and vehicle charges J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). ANY officer who works over 8 consecutive hours shall be paid 1.5x of the base pay rate for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. If the contractor cancels the detail OR the detail ends early, with officer on-site, the vendor will get billed for the entirety of the scheduled detail with all associated fees."
  },
  {
    "Id": "263",
    "ClientId": "24",
    "Title": "Jobs4Blue Rate Sheet - Westampton PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $85.00/hr Non-Profit Rate: $65.00 PAGEBREAK[] Fees: Admin/ Vehicle Fee: $10.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired For Construction / For-Profit jobs ONLY: If the jobs goes past the scheduled end time, officers will be compensated at the rate of $100.00/hr for each additional work hour past the scheduled end time of the detail. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay including the admin and J4B fees."
  },
  {
    "Id": "264",
    "ClientId": "19",
    "Title": "Jobs4Blue Rate Sheet - Westfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Vehicle Fee: $150.00 per day, per vehicle utilized Admin Fee: 10% of the officer wages and vehicle charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired for ALL jobs Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Information: For SECURITY jobs only: If you would like to request a \"Plain-Clothes\" Security officer, please note this in the COMMENTS section of your job posting."
  },
  {
    "Id": "265",
    "ClientId": "49",
    "Title": "Jobs4Blue Rate Sheet - Westport PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $82.50/hr PAGEBREAK[] Fees: Vehicle Fee: $30.00/hr per vehicle utilized Police Boat Fee (if applicable): $75.00/hr J4B Service Fee: 7% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired for private security, crowd control and race events There is a 4-hour minimum per each officer hired for traffic control and construction All jobs are rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum. All fees apply."
  },
  {
    "Id": "266",
    "ClientId": "81",
    "Title": "Jobs4Blue Rate Sheet - Willingboro PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Officer Hourly Rates and determined by RANK OF OFFICER. PAGEBREAK[] Officer / Detective Rates: Non-Profit Organization: $75.00/hr per officer For-Profit Organization: $85.00/hr per officer For-Profit Organization posted less than 24 hours' notice, on a recognized Holiday, OR on a Weekend: $100.00/hr per officer PAGEBREAK[] Sergeant, Lieutenant, Captain Rate: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $101.19-$127.39 per hour per officer. PAGEBREAK[] Fees: Vehicle Fee: $100.00 per day, per vehicle utilized. Admin Fee: 13% of the officer wages and vehicles charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. All jobs (security and traffic) REQUIRE a police vehicle per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "267",
    "ClientId": "126",
    "Title": "Jobs4Blue Rate Sheet - Belleville PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $79.00/hr PAGEBREAK[] Fees: Admin Fee: $3.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "268",
    "ClientId": "39",
    "Title": "Jobs4Blue Rate Sheet - Barnegat PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $105.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Barnegat PD for approval before the request is posted. If your request is CANCELLED by Barnegat Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "269",
    "ClientId": "129",
    "Title": "Jobs4Blue Rate Sheet - Brigantine PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $65.00/hr PAGEBREAK[] Fees: Admin Fee: $35.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 2.25 hours worked = 2.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. All fees apply."
  },
  {
    "Id": "270",
    "ClientId": "118",
    "Title": "Jobs4Blue Rate Sheet - Clark PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Traffic Rate: $80.00/hr Hourly Security Rate: $60.00/hr EMERGENCY Rate (jobs called in with less than 3 hours notice): $90.00/hr Premium Overtime Rate (over 8 consecutive hours of work): $120.00/hr (non-emergency job) or $135.00/hr (emergency job) PAGEBREAK[] Fees: Admin Fee: $16.2% of the job cost Vehicle Fee: $150.00 per day per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Traffic Control Details ONLY: Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> jobs are paid out in 1/2 hour increments. All jobs over 8 consecutive hours are paid out at a premium overtime rate as listed above. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "271",
    "ClientId": "119",
    "Title": "Jobs4Blue Rate Sheet - Fanwood PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $91.76/hr PAGEBREAK[] Fees: Admin Fee: $20.00 per officer hired Vehicle Fee: $150.00 per day per vehicle utilized (only applicable for Traffic jobs) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "272",
    "ClientId": "116",
    "Title": "Jobs4Blue Rate Sheet - Hackensack PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr Non-Profit Educational and Religious Institution Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the full work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: If the contractor requests \"NO PARKING\" signs, the contractor must call the Traffic Division at (201) 646-7738 to make the request and schedule the pickup. Signs should be posted no later than 2PM the day prior to the work detail."
  },
  {
    "Id": "273",
    "ClientId": "122",
    "Title": "Jobs4Blue Rate Sheet - Ocean County Sheriff (NJ)",
    "Body": "PAGEBREAK[] Please note that the local police jurisdiction should be contacted first BEFORE outsourcing to the Ocean County Sheriff's Office. PAGEBREAK[] Officer Wages: Hourly Rate: $75.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "274",
    "ClientId": "117",
    "Title": "Jobs4Blue Rate Sheet - Plainsboro PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $85.00/hr Short Notice Hourly Rate (jobs called within 24-hours' notice): $95.00/hr House of Worship Rate: $70.00/hr PAGEBREAK[] Fees: Social Security Admin Fee: 7.65% of wage cost Workers Comp Admin Fee: $0.52/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. If 4+ officers are being requested, an additional police Supervisor must be hired at the Supervisor Rate (+$5.00/hr) of the hourly rate. If the job goes over 8 consecutive hours in duration -> hourly rate increases to 1.5x of the hourly rate for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. If the contractor cancels ANY work detail AFTER the job time begins, the contractor is responsible for compensating the officer for the entire scheduled shift. All fees apply. PAGEBREAK[] General Information: If a scheduled job ends early (see cancellation policy above), the officer gets compensated for the entire scheduled shift."
  },
  {
    "Id": "275",
    "ClientId": "128",
    "Title": "Jobs4Blue Rate Sheet - Raritan Borough PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $35.00 per vehicle utilized, per day. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up by 2-hour blocks after the 4-hour minimum. (i.e. 4.5 hours would be billed at 6 hours.) Vehicles are REQUIRED for all Road Jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "276",
    "ClientId": "114",
    "Title": "Jobs4Blue Rate Sheet - Robbinsville PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $83.00/hr Emergency Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $12.00/hr per officer Vehicle Fee: $50.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: Standard Non-Emergency Job: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the hour. (i.e. 4.5 hours worked = 5 hours pay to officer). If a NON-EMERGENCY job goes over 8 consecutive hours in duration -> hourly rate increases to $124.50/hr for each additional work hour. PAGEBREAK[] Emergency Job: There is a 3-hour minimum for all emergency jobs. Officer compensation is rounded up to the hour. (i.e. 4.5 hours worked = 5 hours pay to officer). If an EMERGENCY job goes over 8 consecutive hours in duration -> hourly rate increases to $142.50/hr for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. If the contractor cancels the detail OR the detail ends early, with officer on-site, the vendor will get billed for the entirety of the scheduled detail with all associated fees."
  },
  {
    "Id": "277",
    "ClientId": "115",
    "Title": "Jobs4Blue Rate Sheet - Springfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Day Rate (hours worked between 6AM-8PM): $75.00/hr Evening Rate (hours worked between 8PM-6AM): $90.00/hr Emergency Rate (less than 4 hours notice): $100.00/hr Non-Profit Rate: $60.00/hr PAGEBREAK[] Fees: Vehicle Fee: $30.00/hr per vehicle utilized. Vehicles are REQUIRED for all Road Jobs. Admin Fee: $10.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. Officer compensation is rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). If a Day Rate job goes over 8 consecutive hours in duration -> hourly rate increases to $85.00/hr for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "278",
    "ClientId": "120",
    "Title": "Jobs4Blue Rate Sheet - Winfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $80.00/hr Non-Utility / Special Event Rate: $65.00/hr PAGEBREAK[] Fees: Vehicle Fee: $125.00 per day, per vehicle utilized Admin Fee: 5% of the officer wages and vehicle charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum if the job goes over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "279",
    "ClientId": "133",
    "Title": "Jobs4Blue Rate Sheet - Bernardsville PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: For-Profit Rate: $99.62/hr Non-Profit Rate: $89.62/hr PAGEBREAK[] Fees: Admin Fee: $75.00 for the FIRST day; $25.00 for each additional day of a continuing job Vehicle Fee: $25 per vehicle utilized, per day J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs are rounded to the nearest full hour (ie. 4.5 hours will be billed for 5 hours) For-Profit jobs ONLY: Any additional hours worked by officers OUTSIDE the scheduled job times: officer rate increases to $132.81/hr for each additional hour PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 8 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. If the contractor cancels the detail OR the detail ends early, with officer on-site, the vendor will get billed for the entirety of the scheduled detail with all associated fees. PAGEBREAK[] General Information: All NEW vendors must submit Proof of Liability Insurance to Bernardsville prior to the start date of their first detail."
  },
  {
    "Id": "280",
    "ClientId": "127",
    "Title": "Jobs4Blue Rate Sheet - East Windsor PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: 15.16% of total officer wages Vehicle Fee: $6.25/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. All jobs round up to the full work hour (ie. 4.5 hours will be billed at 5 hours) PAGEBREAK[] Cancellation Policy: Jobs scheduled between 2-4 hours in duration: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the amount of time that the job was scheduled for. All fees apply. Jobs scheduled for 4+ hours in duration: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to East Windsor PD for approval before the request is posted. If your request is CANCELLED by East Windsor Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "281",
    "ClientId": "132",
    "Title": "Jobs4Blue Rate Sheet - Beverly PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr per officer PAGEBREAK[] Fees: Admin Fee: 10% of the total wages Vehicle Fee: $100.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: IIf the contractor cancels ANY work detail within 4-hours of the assignment start time, the contractor is responsible for compensating the officer(s) to the 3-hour minimum pay. Admin and J4B fees apply. PAGEBREAK[]"
  },
  {
    "Id": "282",
    "ClientId": "125",
    "Title": "Jobs4Blue Rate Sheet - Bradley Beach PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $93.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00 per officer, per job Vehicle Fee: $100.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1-hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "283",
    "ClientId": "131",
    "Title": "Jobs4Blue Rate Sheet - Englewood PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $30.00 per day Vehicle Fee: $15.00 per hour, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs worked between 4 and 6.5 hours -> compensation is rounded up to the full work hour (i.e. 4.5 hours worked will be billed at 5 hours) All jobs worked beyond 6.5 hours and 8 hours -> compensation is rounded up to an 8-hour minimum (i.e. 6.5 hours worked will be billed at 8 hours). All jobs worked beyond 8 hours ->compensation is rounded up to the full hour. (i.e. 8.5 hours worked will be billed at 9 hours). PAGEBREAK[] Cancellation Policy: If the contractor cancels any work detail within 2-hours of the scheduled start time, the contractor is responsible for compensating the officer to a 4-hour minimum. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[]"
  },
  {
    "Id": "284",
    "ClientId": "-1",
    "Title": "Jobs4Blue Rate Sheet - Essex County Sheriff PD (NJ)",
    "Body": "X"
  },
  {
    "Id": "285",
    "ClientId": "123",
    "Title": "Jobs4Blue Rate Sheet - Hamilton Twp PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Traffic Rate: $90.00/hr Hourly Security Rate: $60.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $12.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired for ALL Road Jobs. There is a 2-hour minimum per each officer hired for ALL Security Jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels any work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to a 2-hour minimum pay. Admin and J4B Fees apply. If the contractor cancels any work detail AFTER an officer is onsite, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All Fees apply. If the contractor cancels any work detail AFTER the officer is on site AND the job has begun, the contractor is responsible for compensating the officer to the FULL SHIFT time as scheduled. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "287",
    "ClientId": "136",
    "Title": "Jobs4Blue Rate Sheet - Lakehurst PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $35.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "288",
    "ClientId": "135",
    "Title": "Jobs4Blue Rate Sheet - New Providence PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Day Hourly Rate (7AM-7PM): $96.00/hr Evening Hourly Rate (7PM-7AM): $111.00/hr Emergency Rate (less than 4 hours' notice): $111.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee: $100.00 per vehicle, per day J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up by 2-hour blocks, if the job goes over the originally scheduled time. (i.e. A job scheduled for 4-hours, lasting 5 hours in duration will be billed at 6 hours.) PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer up to a 4-hour minimum (not to exceed job scheduled times). If the contractor cancels ANY work detail after an officer is onsite, the contractor is responsible for compensating the officer up to an 8-hour minimum (not to exceed job scheduled times)."
  },
  {
    "Id": "289",
    "ClientId": "121",
    "Title": "Jobs4Blue Rate Sheet - Morris County Sheriff PD (NJ)",
    "Body": "PAGEBREAK[] For MUTUAL AID COVERAGE: Please note that the local police jurisdiction should be contacted first BEFORE outsourcing to the Morris County Sheriff's Office. For PARK JOBS: Please continue with booking as the Morris County Sheriff's Office covers all Morris County Parks. PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $7.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "290",
    "ClientId": "146",
    "Title": "Jobs4Blue Rate Sheet - Scarsdale PD (NY)",
    "Body": "PAGEBREAK[] Officer Wages: $157.68/hr per officer PAGEBREAK[] Hiring Rules: There is a 3 hour minimum per each officer hired for ALL jobs. CONSTRUCTION THAT INVOLVES THE OPENING OF ANY ROAD IN THE VILLAGE OF SCARSDALE REQUIRES A ROAD OPENING PERMIT FROM THE SCARSDALE ENGINEERING DEPARTMENT PRIOR TO ANY WORK BEING PERFORMED. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 3 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay. All fees apply. PAGEBREAK[] GENERAL HIRING ACKNOWLEDGEMENT: Contractor agrees to indemnify and hold harmless the Village of Scarsdale, its agents, employees, and officers from all claims, actions, proceedings, judgments, expenses, or costs arising from any action taken by a Village of Scarsdale Police Officer working pursuant to Section 81-2 of the Code of the Village of Scarsdale. Scarsdale Police Officers assigned to Special Duty parties and security details are mandated to take immediate enforcement action for any violations of the law they observed, including but not limited to underage drinking and illegal drug use. The Police Officers assigned to this event are on duty and are subject to the rules and regulations of the Scarsdale Police Department. These officers will follow the direction of their immediate supervisors and adhere to the chain of command of the Scarsdale Police Department only."
  },
  {
    "Id": "291",
    "ClientId": "139",
    "Title": "Jobs4Blue Rate Sheet - Highland Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $85.00/hr per officer Non-Profit / House of Worship Rate: $65.00/hr per officer PAGEBREAK[] Fees: Admin Fee: 15% of total officer wages Vehicle Fee (HALF DAY - less than 4 hours): $20.00/hr per vehicle utilized Vehicle Fee (FULL DAY - more than 4 hours): $100.00 FLAT, per day J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired for standard details. There is a 2-hour minimum per each officer hired for Non-Profit / House of Worship details. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to a 2-hour minimum pay. All admin fees apply. If the contractor cancels ANY work detail AFTER the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay (not to exceed job scheduled time). All admin fees apply."
  },
  {
    "Id": "292",
    "ClientId": "140",
    "Title": "Jobs4Blue Rate Sheet - Keyport PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $75.00/hr PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. A police vehicle is REQUIRED for all jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "293",
    "ClientId": "141",
    "Title": "Jobs4Blue Rate Sheet - Essex Fells PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Officer Wage: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $34.42 and $129.33 per hour per officer. Non-Profit / House of Worship Rate: $65.00/hr PAGEBREAK[] Fees: Admin Fee: 10% of the officer wages and vehicle charge Vehicle Fee: $15.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer wages are rounded up to the nearest 1/2 hour. (i.e. An officer working 4.25 hours would be compensated for 4.5 hours.) PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "294",
    "ClientId": "143",
    "Title": "Jobs4Blue Rate Sheet - Little Ferry PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $125.00/hr per officer PAGEBREAK[] Fees: Vehicle Fee: $100 per vehicle, per day. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Police Vehicle is REQUIRED for all jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. J4B fee applies."
  },
  {
    "Id": "295",
    "ClientId": "145",
    "Title": "Jobs4Blue Rate Sheet - Allentown PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer Vehicle Fee: $125.00 per day per vehicle utilized (up to 8 hours) Vehicle Fee ADDITIONAL HOURS: $35.00/hr for each additional hour, after 8 hours J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. J4B Service Fee Applies. PAGEBREAK[]"
  },
  {
    "Id": "296",
    "ClientId": "147",
    "Title": "Jobs4Blue Rate Sheet - Winslow Twp. PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $90.00/hr per officer Premium Hourly Rate: $95.00/hr per officer (for weekends, holidays or any job with less than 24 hours notice.) PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Winslow Twp. PD for approval before the request is posted. If your request is CANCELLED by Winslow Twp. Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "297",
    "ClientId": "137",
    "Title": "Jobs4Blue Rate Sheet - Edgewater Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly REGULAR Rate (Jobs worked between the hours of 6AM-6PM): $100.00/hr per officer Hourly AFTER HOURS Rate (Jobs worked between the hours of 6PM-6AM): $125.00/hr per officer Weekend Rate: $125.00/hr per officer Holiday Rate: $150.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $75.00 per day of job Vehicle Fee: $100.00 per day, per vehicle utilized J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest 1/2 hour (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail between 8 and 3 hours of the assignment start time, the contractor is responsible for compensating the officer to a 2-hour minimum pay. Admin Fee and Jobs4Blue Fee apply. If the contractor cancels ANY work detail less than 3 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Admin Fee and Jobs4Blue Fee apply. If the contractor cancels ANY work detail AFTER the start time of the assignment, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: If any job is set to the premium rate (i.e. Weekends / After Hours / Holiday) - the job will remain at the premium rate for the entire duration of the work detail."
  },
  {
    "Id": "298",
    "ClientId": "150",
    "Title": "Jobs4Blue Rate Sheet - Pemberton Borough PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Regular Rate: $85.00/hr Emergency Rate (Jobs posted within 24 hours' notice): $95.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr, per officer Vehicle Fee: $150.00 per day, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1300",
    "ClientId": "151",
    "Title": "Jobs4Blue Rate Sheet - Berkeley Heights PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Regular Rate: $85.00/hr Evening Rate (Jobs worked between 8PM-6AM): $100.00/hr Emergency Rate (Jobs called in within 12-hours' notice) $100.00/hr Holiday Rate: $100.00/hr Supervisor Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $8.00/hr per officer Vehicle Fee: $10.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs requesting 4 or more officers will require a Supervisor (at $90.00/hr) If the job goes over 8 consecutive hours in duration -> hourly rate increases to the $100.00 for each additional work hour. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer(s) a 2-hour minimum pay. Admin fees apply. If the contractor cancels any work detail after the start time of the job, the contractor is responsible for compensating the officer(s) a 4-hour minimum. All fees apply."
  },
  {
    "Id": "1301",
    "ClientId": "152",
    "Title": "Jobs4Blue Rate Sheet - Mountain Lakes PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Pay Rate is determined by officer OVERTIME rate, and can be anywhere between $109.29-$113.08 per hour, per officer. PAGEBREAK[] Fees: Admin Fee: 15% of the hourly wages Vehicle Fee: $100.00 per vehicle utilized J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest half hour (i.e. 4.25 hours worked = 4.5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1302",
    "ClientId": "154",
    "Title": "Jobs4Blue Rate Sheet - Bay Head PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: DAYTIME Hourly Rate (Jobs worked between the hours of 7AM-7PM): $85.00/hr EVENING Hourly Rate (Jobs worked between the hours of 7PM-7AM): $95.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1303",
    "ClientId": "155",
    "Title": "Jobs4Blue Rate Sheet - Haddon Heights PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.08/hr PAGEBREAK[] Fees: Admin Fee: 15% of the officer hourly wages Vehicle Fee: $15.00 per hour, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1304",
    "ClientId": "156",
    "Title": "Jobs4Blue Rate Sheet - Oaklyn PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest 1/2 hour. (i.e. 4.25 hours worked = 4.5 hours paid to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Admin and J4B fees apply."
  },
  {
    "Id": "1305",
    "ClientId": "157",
    "Title": "Jobs4Blue Rate Sheet - Woodland Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee: $5.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the nearest work hour. (i.e. 4.5 hours worked = 5 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1306",
    "ClientId": "158",
    "Title": "Jobs4Blue Rate Sheet - Little Falls PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Officer Hourly Rate: $85.85/hr per officer Charitable Organization Rate: $50.00/hr per officer Captain Rate: $151.38/hr if Captain is assigned the detail Chief Rate: $171.06/hr if Chief is assigned the detail PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee: $12.50/hr per vehicle utilized. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. There is a 6-hour minimum if the Chief of Police or the Police Captain are assigned to the detail. If the job goes over 8 consecutive hours in duration -> hourly rate increases to $113.32/hr per officer for any additional time spent on the job. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay OR the Chief/Captain to the 6-hour minimum pay. All fees apply."
  },
  {
    "Id": "1309",
    "ClientId": "160",
    "Title": "Jobs4Blue Rate Sheet - Point Pleasant Borough PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $75.00/hr Security/Non-Traffic/BOE Rate: $55.00/hr PAGEBREAK[] Fees: Admin Fee: $6.00/hr per officer Vehicle Fee: $25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. There is a 3 hour minimum for BOE Jobs only. Vehicles are REQUIRED for all road jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "1312",
    "ClientId": "162",
    "Title": "Jobs4Blue Rate Sheet - Ewing PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Officer Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $5.00 per job hour Vehicle Fee: $15.00 per hour, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer wages are rounded up to the nearest 1/2 hour. (i.e. An officer working 4.25 hours would be compensated for 4.5 hours.) PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All Contractors of the Ewing Township Police Department must provide a valid Certificate of Insurance (COI) when working with the Ewing Township Police Department. Please note that this is a requirement in order to do business with the Township of Ewing. An up-to-date COI must be submitted to Jobs4Blue, prior to booking your police officer, with \"Ewing Township\" listed as an additional insured party."
  },
  {
    "Id": "1324",
    "ClientId": "159",
    "Title": "Jobs4Blue Rate Sheet - Waldwick PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr or 1.5x Officer's Hourly Rate - whichever is greater. PAGEBREAK[] Fees: Waldwick Admin Fee: 6% of total wages Waldwick Social Security Fee: 7.65% of total wages Waldwick NJ SUI Fee: 0.225% of total wages Waldwick Workers Comp Fee: 5% of total wages Waldwick Vehicle Fee: $25.00/hr per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Admin fees apply."
  },
  {
    "Id": "1328",
    "ClientId": "148",
    "Title": "Jobs4Blue Rate Sheet - Aberdeen PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $114.12/hr PAGEBREAK[] Fees: Vehicle Fee: 5% of officer hourly wages Admin Fee: 15% of officer hourly wages J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is paid in 2-hour blocks. (I.E. 4.5 hours worked will be paid out at 6-hours to the officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Admin fees apply."
  },
  {
    "Id": "1337",
    "ClientId": "166",
    "Title": "Jobs4Blue Rate Sheet - Holmdel PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Admin fees apply."
  },
  {
    "Id": "1339",
    "ClientId": "163",
    "Title": "Jobs4Blue Rate Sheet - Trenton PD (NJ)",
    "Body": "PAGEBREAK[] Officer Hourly Wages: Security Rate: determined by Trenton PD at the time of request (Ranges from $40.00-$55.00/hr) Liquor Establishment Rate: $65.00/hr Traffic Control/Enforcement Rate (any time): $85.00/hr PAGEBREAK[] Fees: Admin Fee: 14% of officer wage cost Vehicle Fee: $10.00/hr, per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to the half hour. (i.e. 4.25 hours worked = 4.5 hours pay to officer). Marked Police Vehicle is REQUIRED for all road jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "1341",
    "ClientId": "134",
    "Title": "Jobs4Blue Rate Sheet - Seymour PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $73.38/hr Evening Rate: (Job hours worked between 11PM-7AM) $74.38/hr Holiday Rate: $97.84/hr Town Job Rate: $56.18/hr PAGEBREAK[] Fees: Admin Fee: $50.00 per scheduled 4-HOUR BLOCK. Vehicle Fee: $30.00/hr per vehicle utilized. NOTE: If a PERSONAL VEHICLE is utilized - the Officer rate will increase by $4.00/hr; no vehicle fee will be charged. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Jobs lasting longer than 4 hours in duration will be rounded up in 4-HOUR BLOCKS. This means that jobs will be billed in 4-hour increments (4 hours, 8 hours, 12 hours, etc.) until job completion. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to a 2-hour minimum pay. Both the Admin Fee and J4B Service fee apply. If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Both the Admin Fee and J4B Service fee apply."
  },
  {
    "Id": "1342",
    "ClientId": "165",
    "Title": "Jobs4Blue Rate Sheet - Port Chester PD (NY)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $113.40/hr per officer Security Rate: $100.44/hr per officer PAGEBREAK[] Fees: Vehicle Fee: $50.00 per day, per vehicle utilized PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired for ALL jobs. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation request is made before the job commences. PAGEBREAK[] General Information: If \"No Parking\" signs are needed: please email Sgt. Dusenbury, at sgtdusenbury@portchesterny.gov.]"
  },
  {
    "Id": "1345",
    "ClientId": "168",
    "Title": "Jobs4Blue Rate Sheet - Englishtown PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Any job that goes beyond the scheduled contracted time will be compensated at $170.00/hr for each additional hour worked. Any job that goes beyond the scheduled contracted time will have an Admin Fee charged at $30.00/hr for each additional hour worked. Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). If the job ends early, officer is compensated for the entire scheduled shift. PAGEBREAK[] Cancellation Policy: If the contractor cancels any work detail within 12 to 4 hours of the scheduled start time, the contractor is responsible for compensating the officer to a 2-hour minimum. All fees apply. If the contractor cancels any work detail within 4 to 2 hours of the scheduled start time, the contractor is responsible for compensating the officer to a 4-hour minimum. All fees apply. If the contractor cancels any work detail within 2-hours of the scheduled start time, the contractor is responsible for compensating the officer to the full scheduled shift. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1346",
    "ClientId": "161",
    "Title": "Jobs4Blue Rate Sheet - Atlantic City PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Default Hourly Rate: $70.00/hr Supervisor Rate: 1.5x the Hourly Rate of the Supervisor assigned Specialist Rate (K9, Bomb Squad, Tactical, Accident Bureau, Office of Emergency Management): 1.5x the Hourly Rate of the Specialist assigned PAGEBREAK[] Fees: Admin Fee: $12.15/hr per officer Vehicle Fee: $5.00/hr per vehicle utilized J4B Service Fee: 8% of the officer wage cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Any job requests for 6-9 officers shall require (1) Sergeant, as the job Supervisor. Any job requests for 10-15 officers shall require (1) Sergeant and (1) Lieutenant as the job Supervisors. Any job requests for 15+ officers shall require (2) Sergeants and (1) Captain. as the job Supervisors. Any requests for a BOXING / MIXED MARTIAL ARTS event requires a minimum of (4) officers and (1) Supervisor PAGEBREAK[] Cancellation Policy: If the contractor cancels any work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "1347",
    "ClientId": "169",
    "Title": "Jobs4Blue Rate Sheet - Bedminster PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00 per hour PAGEBREAK[] Fees: Admin Fee: $35.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1348",
    "ClientId": "167",
    "Title": "Jobs4Blue Rate Sheet - Shaker Heights PD (OH)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $60.00/hr PAGEBREAK[] Fees: J4B Service Fee: 10% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. All jobs are rounded up by 15-minute increments. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. J4B fee applies."
  },
  {
    "Id": "1349",
    "ClientId": "171",
    "Title": "Jobs4Blue Rate Sheet - Pohatcong PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $95.00/hr PAGEBREAK[] Fees: J4B Service Fee: 8% of the total cost] PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. Jobs4Blue Service Fee Applies."
  },
  {
    "Id": "1350",
    "ClientId": "172",
    "Title": "Jobs4Blue Rate Sheet - Blairstown PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $80.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $20.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1-hour of the assignment start time, the contractor is responsible for compensating the officer(s) to the 4-hour minimum pay. Admin and J4B fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1351",
    "ClientId": "170",
    "Title": "Jobs4Blue Rate Sheet - Phillipsburg PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $93.81/hr per officer PAGEBREAK[] Fees: Admin Fee: 10% of officer hourly wages Vehicle Fee: $150.00 per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2.5-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2.5-hour minimum pay. Admin and J4B Fees Apply."
  },
  {
    "Id": "1352",
    "ClientId": "173",
    "Title": "Jobs4Blue Rate Sheet - Hightstown PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr Hourly Emergency Rate (jobs called in with less than 24 hours' notice): $105.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr Vehicle Fee: $20.00/hr J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Any job duration that goes beyond 8 consecutive hours worked will result in a premium rate of $105.00/hr for each additional hour PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All Fees Apply."
  },
  {
    "Id": "1353",
    "ClientId": "176",
    "Title": "Jobs4Blue Rate Sheet - Peapack & Gladstone (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $30.00/hr, per officer Vehicle Fee: $25.00/hr, per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 3-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 3-hour minimum pay. Admin fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1354",
    "ClientId": "175",
    "Title": "Jobs4Blue Rate Sheet - Ridgewood PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $105.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer Ridgewood Filing Fee: $20.00 per day Vehicle Fee: $25.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All admin fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1355",
    "ClientId": "177",
    "Title": "Jobs4Blue Rate Sheet - Cinnaminson PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr Town Job/BOE/Non-Profit Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee: $150.00 per day (Jobs over 8 hours) Vehicle Fee: $18.50/hr per vehicle (Any job less than 8 hours) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Jobs4Blue service fee applies. PAGEBREAK[]"
  },
  {
    "Id": "1356",
    "ClientId": "174",
    "Title": "Jobs4Blue Rate Sheet - Cliffside Park PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $100.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer Vehicle Fee: $5.00/hr per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay including all fees."
  },
  {
    "Id": "1357",
    "ClientId": "180",
    "Title": "Jobs4Blue Rate Sheet - Edgewater PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr, per officer PAGEBREAK[] Fees: Admin Fee: $10.00/hr, per officer Edgewater Filing Fee: $25.00 per officer, per job Vehicle Fee: $50.00 (All jobs up to 8 hours in duration) Vehicle Fee: $75.00 (All jobs 9+ hours in duration) J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to 10 hours. Any job 10+ hours is paid out at straight time worked. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. Admin fees apply. If the contractor cancels ANY work detail after an officer is onsite, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Edgewater PD for approval before the request is posted. If your request is CANCELLED by Edgewater Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "1359",
    "ClientId": "178",
    "Title": "Jobs4Blue Rate Sheet - Mount Laurel PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00 per hour, per officer PAGEBREAK[] Fees: Admin Fee: 10.00/hr per officer J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Cancellation Policy: If the job is more than 4 hours in duration: - If the job is cancelled within 8 hours of the assignment start time -> officer is compensated a 4-hour minimum. All fees apply. If the job is less than 4 hours in duration: - Cancelled within 8 hours of the assignment start time -> officer receives the minimum hours scheduled for the job. All fees apply. PAGEBREAK[] General Information: All requests for roadwork will automatically be sent to Mount Laurel PD for approval before the request is posted. If your request is CANCELLED by Mount Laurel Traffic/Safety personnel: you will receive an email from VCS on the cancellation reason."
  },
  {
    "Id": "1360",
    "ClientId": "181",
    "Title": "Jobs4Blue Rate Sheet - Milltown PD (NJ)",
    "Body": "Officer Wages: Traffic Rate: $85.00/hr per officer Security Rate: $55.00/hr per officer PAGEBREAK[] Fees: Vehicle Fee: $12.00/hr per vehicle utilized Admin Fee: 18% of officer and vehicle charges J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired for standard details. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply."
  },
  {
    "Id": "1361",
    "ClientId": "182",
    "Title": "Jobs4Blue Rate Sheet - Kenilworth PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Traffic Rate: $95.00/hr per officer Security Rate: $50.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $15.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). If the job goes over 8 consecutive hours in duration -> Officer compensation is rounded up to the full work hour. (i.e. 8.5 hours worked = 9 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum compensation. Admin fees apply. Vehicle fee will apply if cancellation is made onsite and a vehicle has been utilized."
  },
  {
    "Id": "1362",
    "ClientId": "184",
    "Title": "Jobs4Blue Rate Sheet - Manasquan PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.62/hr PAGEBREAK[] Fees: Admin Fee: $9.42/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  },
  {
    "Id": "1363",
    "ClientId": "185",
    "Title": "Jobs4Blue Rate Sheet - Naugatuck PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Regular Rate: $135.12/hr Evening Rate: (Job hours worked between 8PM-6AM) $157.14/hr Sunday and Holiday Rate: $223.18/hr New Years Eve (12/31) Rate: $311.24/hr PAGEBREAK[] HOLIDAYS INCLUDE: New Year's Day | Martin Luther King Day | Easter Sunday | Good Friday | Memorial Day | Fourth of July | Labor Day | Columbus Day/Indigenous Peopleâ€™s Day | Veteran's Day | Thanksgiving Day | Friday following Thanksgiving Day | Day before Christmas Day | Christmas Day PAGEBREAK[] Fees: Late Call Fee: $20.00/hr per officer (applied if job request comes in after 3PM FOR tomorrow or it is a SAME-DAY job.) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Jobs lasting longer than 4 hours in duration will be rounded up in 4-HOUR BLOCKS. This means that jobs will be billed in 4-hour increments (4 hours, 8 hours, 12 hours, etc.) until job completion. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply. This applies to ALL 4-hour blocks scheduled."
  },
  {
    "Id": "1364",
    "ClientId": "179",
    "Title": "Jobs4Blue Rate Sheet - William Paterson University PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $75.00/hr PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 2-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 2-hour minimum pay. Admin fees apply."
  },
  {
    "Id": "1366",
    "ClientId": "191",
    "Title": "Jobs4Blue Rate Sheet - Woolwich Twp PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Vehicle Fee: $17.00/hr per vehicle utilized Admin Fee: 15% of the officer wage / vehicle fee cost J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs 8+ hours in duration will be SPLIT into two equal job shifts. The 4-hour minimum only applies to the FIRST shift. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1367",
    "ClientId": "187",
    "Title": "Jobs4Blue Rate Sheet - Barrington PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: 15% of the officer hourly wages and vehicle cost Vehicle Fee: $15.00/hr per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. All jobs 8+ hours in duration will be SPLIT into two equal shifts. The cancellation rules listed below apply to BOTH shifts. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer(s) to the 4-hour minimum pay. Admin fees apply. Vehicle Fee will not be charged if job is cancelled before the scheduled start time."
  },
  {
    "Id": "1368",
    "ClientId": "190",
    "Title": "Jobs4Blue Rate Sheet - Guttenberg PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Day Rate (hours worked between 6AM-5:59PM): $85.00/hr Evening Rate (hours worked between 6PM-5:59AM): $95.00/hr Emergency Rate (less than 24 hours' notice): $95.00/hr Weekend and Holiday Rate: $95.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer Vehicle Fee (less than 8-hour job): $100.00 flat fee per vehicle utilized Vehicle Fee (more than 8-hour job): $100.00 flat fee +$15.00/hr for every hour after 8-hour mark PBA Fee: $1.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. Regular Rate Detail ($85/hr): If the job goes over 8 consecutive hours in duration -> hourly rate increases to $127.50/hr for each additional work hour. Premium Rate Detail ($95/hr): If the job goes over 8 consecutive hours in duration -> hourly rate increases to $142.50/hr for each additional work hour. Non-Emergency jobs, or jobs with more than 4 hours' notice, cannot be scheduled before 8:00am or run past 5:00PM PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1.5 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay at the applicable pay rate of the job. PBA and Jobs4Blue fees apply."
  },
  {
    "Id": "1370",
    "ClientId": "186",
    "Title": "Jobs4Blue Rate Sheet - Rutherford PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $125.00/hr per officer PAGEBREAK[] Fees: Admin Fee: $10.00/hr per officer Vehicle Fee: $200.00 per day per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 6-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 6-hour minimum pay. Vehicle fee will not be charged if cancellation is made before the start time of the detail. All other fees apply. PAGEBREAK[] General Contractor Information: Please contact the Rutherford Borough Clerkâ€™s Office at 201-460-3001,for any jobs that require the opening of the roadway. Rutherford requires a permit for â€œroadway openingsâ€ and a review of proper documentation PRIOR TO the commencement of the road job."
  },
  {
    "Id": "1372",
    "ClientId": "195",
    "Title": "Jobs4Blue Rate Sheet - Bordentown City PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $95.00/hr Premium Hourly Rate: $120.00/hr Any job on weekends or holidays Hourly Rate: $120.00/hr Any job beyond 8 hours, Hourly Rate: $120.00/hr-for each additional hour Any overtime past what job was initially scheduled for, Hourly Rate: $120.00/hr-for each additional hour PAGEBREAK[] Fees: Admin Fee: $15.00 per hour/Per officer J4B Service Fee: 8% of the total cost of the job Vehicle fee: $150 flat rate. After 8 hours: $50.00 flat rate for each 4-hour block afterwards PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. If the job is cancelled after the jobs begins/Officer is on scene, Officer is paid for the full scheduled job. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer for 4 hours. All fees apply."
  },
  {
    "Id": "1373",
    "ClientId": "193",
    "Title": "Jobs4Blue Rate Sheet - Sea Bright PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr PAGEBREAK[] Fees: Admin Fee: $15.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1374",
    "ClientId": "189",
    "Title": "Jobs4Blue Rate Sheet - Spring Lake Heights PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $104.61/hr PAGEBREAK[] Fees: Vehicle Fee: $10.00 per hour per vehicle Admin Fee: $10.00 per hour per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 12 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1375",
    "ClientId": "192",
    "Title": "Jobs4Blue Rate Sheet - West Caldwell (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $103.28 per officer/hour PAGEBREAK[] Fees: Admin Fee: $3.50 per hour/Per officer J4B Service Fee: 8% of the total cost of the job Vehicle fee: $15 per vehicle, per hour PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired and rounded up to 1/2 hour blocks if the job goes beyond 4 hours. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer for 4 hours. Admin fees apply."
  },
  {
    "Id": "1376",
    "ClientId": "188",
    "Title": "Jobs4Blue Rate Sheet - Readington Twp. PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $100.97/hr. PAGEBREAK[] Fees: Admin Fee: 15% of the officer hourly wage amount . Vehicle fee: $20.00/hr per vehicle utilized. J4B Service Fee: 8% of the total cost. PAGEBREAK[] Hiring Rules: There is a 4-hour minimum. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer for 4 hours. All fees apply."
  },
  {
    "Id": "1377",
    "ClientId": "194",
    "Title": "Jobs4Blue Rate Sheet - Point Pleasant Beach PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Rate (Working hours between 7AM-5:59PM): $85.00/hr After-Hours Rate (Working hours between 6PM-6:59AM): $105.00/hr PAGEBREAK[] Fees: Admin Fee: $20.00/hr per officer J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4 hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 1 hour of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1378",
    "ClientId": "196",
    "Title": "Jobs4Blue Rate Sheet - Colts Neck PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $104.81 per hour Non-Profit Hourly Rate: $72.02 per hour PAGEBREAK[] Fees: Admin Fee: $14.19 per hour Non-Profit Admin Fee: $10.98 per hour J4B Service Fee: 8% of the total cost of the job Vehicle fee: $5.00 per hour-for both standard and non-profit details PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer for 4 hours. All fees apply."
  },
  {
    "Id": "1379",
    "ClientId": "198",
    "Title": "Jobs4Blue Rate Sheet - Northfield PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $90.00/hr PAGEBREAK[] Fees: Admin Fee: $35.00 per hour J4B Service Fee: 8% of the total cost of the job PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 24 hours of the assignment start time, the contractor is responsible for compensating the officer for 4 hours. All fees apply. If the job is cancelled after the jobs begins/Officer is on scene, Officer is paid for the full scheduled job. All fees apply."
  },
  {
    "Id": "1380",
    "ClientId": "197",
    "Title": "Jobs4Blue Rate Sheet - Moonachie PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Standard Hourly Rate: $135.13/hr per officer PAGEBREAK[] Fees: Admin Fee: $25.00/hr per officer Vehicle Fee: $200.00/per vehicle utilized J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Officer compensation is rounded up to an 8-hour minimum for any job worked over 4 hours in duration. (i.e. 4.5 hours worked = 8 hours pay to officer). PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 4 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum compensation. Admin and J4B fees apply. Vehicle fee will apply if cancellation is made onsite and a vehicle has been utilized."
  },
  {
    "Id": "1381",
    "ClientId": "199",
    "Title": "Jobs4Blue Rate Sheet - Cheshire PD (CT)",
    "Body": "PAGEBREAK[] Officer Wages: Regular Rate: $128.52/hr Holiday Rate: $171.18/hr Premium Holiday Rate (Christmas Eve/Day, New Years Eve/Day): $213.84/hr PAGEBREAK[] Fees: J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired for any NON-EMERGENCY (more than 4 hours' notice) job. There is a 6-hour minimum per each officer hired for any EMERGENCY (less than 4 hours' notice) job. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to a 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1382",
    "ClientId": "204",
    "Title": "Jobs4Blue Rate Sheet - Old Bridge PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $85.00/hr or 1.5x Officer's Hourly Rate (goes up to $148.08/hr) - whichever is greater. PAGEBREAK[] Fees: Vehicle Fee: $30.00/hr Admin Fee: 4.5% of the Officer Wages and Vehicle Fee. J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. Vehicles are REQUIRED for all Road jobs. Jobs that will span 5+ days AND will be over 8 hours in duration each day will be SPLIT into two, equal shifts (I.E: Job is scheduled Monday-Friday 7AM-4PM -> TWO jobs created: (1) from 7AM-11:30AM and (1) from 11:30AM to 4PM). The cancellation policy listed below applies to BOTH split shifts. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply."
  },
  {
    "Id": "1383",
    "ClientId": "205",
    "Title": "Jobs4Blue Rate Sheet - Ho Ho Kus PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: 1.5x Officer's Hourly Rate PAGEBREAK[] Fees: Admin Fee: 20% of total wages Vehicle Fee: $30.00/hr per vehicle J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. Fees apply."
  },
  {
    "Id": "1384",
    "ClientId": "203",
    "Title": "Jobs4Blue Rate Sheet - Plumsted PD (NJ)",
    "Body": "PAGEBREAK[] Officer Wages: Hourly Rate: $80.00/hr PAGEBREAK[] Fees: Admin Fee: $35.00/hr per officer (includes vehicle cost) J4B Service Fee: 8% of the total cost PAGEBREAK[] Hiring Rules: There is a 4-hour minimum per each officer hired. PAGEBREAK[] Cancellation Policy: If the contractor cancels ANY work detail within 2 hours of the assignment start time, the contractor is responsible for compensating the officer to the 4-hour minimum pay. All fees apply. PAGEBREAK[]"
  }
]